[
  {
    "title": "Advanced AWS Well-Architected Best Practices\t7",
    "description": "Advanced AWS Well-Architected Best Practices\t7에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Amazon SageMaker Studio for Data Scientists\t10",
    "description": "Amazon SageMaker Studio for Data Scientists\t10에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Architecting on AWS\t13",
    "description": "Architecting on AWS\t13에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Cloud Essentials for Business Leaders\t18",
    "description": "AWS Cloud Essentials for Business Leaders\t18에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Cloud Practitioner Essentials\t20",
    "description": "AWS Cloud Practitioner Essentials\t20에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Migration Essentials\t24",
    "description": "AWS Migration Essentials\t24에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Security Essentials\t26",
    "description": "AWS Security Essentials\t26에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Technical Essentials\t28",
    "description": "AWS Technical Essentials\t28에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Well-Architected Best Practices\t31",
    "description": "AWS Well-Architected Best Practices\t31에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "AWS Well-Architected Best Practices (Custom)\t33",
    "description": "AWS Well-Architected Best Practices (Custom)\t33에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Building Batch Data Analytics Solutions on AWS\t35",
    "description": "Building Batch Data Analytics Solutions on AWS\t35에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Building Data Analytics Solutions Using Amazon Redshift\t38",
    "description": "Building Data Analytics Solutions Using Amazon Redshift\t38에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Building Data Lakes on AWS\t41",
    "description": "Building Data Lakes on AWS\t41에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Build Modern Applications with AWS NoSQL Databases\t44",
    "description": "Build Modern Applications with AWS NoSQL Databases\t44에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Building Streaming Data Analytics Solutions on AWS\t47",
    "description": "Building Streaming Data Analytics Solutions on AWS\t47에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Cloud Operations on AWS (구 Systems Operations on AWS)\t50",
    "description": "Cloud Operations on AWS (구 Systems Operations on AWS)\t50에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Data Warehousing on AWS\t54",
    "description": "Data Warehousing on AWS\t54에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Designing and Implementing Storage on AWS\t57",
    "description": "Designing and Implementing Storage on AWS\t57에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Developing Generative AI Applications on AWS\t61",
    "description": "Developing Generative AI Applications on AWS\t61에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Developing on AWS\t65",
    "description": "Developing on AWS\t65에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Developing Serverless Solutions on AWS\t71",
    "description": "Developing Serverless Solutions on AWS\t71에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "DevOps Engineering on AWS\t76",
    "description": "DevOps Engineering on AWS\t76에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Generative AI Essentials on AWS\t79",
    "description": "Generative AI Essentials on AWS\t79에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Migrating to AWS\t82",
    "description": "Migrating to AWS\t82에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "MLOps Engineering on AWS\t86",
    "description": "MLOps Engineering on AWS\t86에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Networking Essentials for Cloud Applications on AWS\t90",
    "description": "Networking Essentials for Cloud Applications on AWS\t90에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Practical Data Science with Amazon SageMaker\t93",
    "description": "Practical Data Science with Amazon SageMaker\t93에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Practical IaC on AWS with Terraform\t96",
    "description": "Practical IaC on AWS with Terraform\t96에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Running Containers on Amazon Elastic Kubernetes Service (Amazon EKS)\t99",
    "description": "Running Containers on Amazon Elastic Kubernetes Service (Amazon EKS)\t99에 대한 과정 설명입니다.",
    "level": "미지정",
    "delivery_method": "강의실 교육",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "",
    "modules": [],
    "labs": []
  },
  {
    "title": "Security Engineering on AWS\t103",
    "description": "실무 위주의 본 고급 기술 수준 강사 주도형 교육에서는 효과적이고 효율적인 AWS Well-Architected Framework 검토를 실시하는 데 도움이 되는 Amazon Web Services(AWS) 모범 사례를 심층적으로 분석합니다. 이 과정에서는 검토를 준비하는 방법, 검토를 실행하는 방법, 검토 후 지침을 받는 방법을 포함하여 각 검토 단계를 다룹니다. 이 과정은 AWS 고객 및 파트너를 위해 설계되었습니다. 참가자는 이 과정에 대한 200 레벨 중급 선행 과정에서 다루는 AWS 개념, 용어, 서비스 및 도구에 익숙해야 합니다. 이 과정은 위험 요소의 우선순위 파악 및 솔루션 제시에 관한 AWS Well-Architected Framework 검토 시뮬레이션과 강사 주도형 그룹 연습/토론을 제공합니다. 과정의 콘텐츠는AWS Well-Architected Tool을 사용하여 고위험 및 중위험 문제에 대한 제안을 준비하는 방법에 중점을 둡니다. Amazon SageMaker Studio는 데이터 사이언티스트가 ML 전용으로 구축된 광범위한 기능 세트를 통합하여 기계 학습(ML) 모델을 신속하게 준비, 구축, 교육, 배포 및 모니터링할 수 있도록 지원합니다. 이 교육 과정에서는 숙련된 데이터 사이언티스트가 SageMaker Studio의 일부인 도구를 사용하여 ML 라이프사이클의 모든 단계에서 생산성을 개선할 수 있는 방법을 학습합니다.. 이 과정에서는 복원력 있고 안전하며 가용성이 뛰어난 IT 솔루션을 AWS 클라우드에 구축하기 위한 서비스와 기능에 대해 배웁니다. 아키텍처 솔루션은 산업, 애플리케이션 유형, 비즈니스 규모에 따라 다릅니다. AWS 공인 강사들이 AWS Well-Architected Framework를 사용하는 모범 사례를 강조하고, 실제 시나리오를 기반으로 최적의 IT 솔루션을 설계하는 프로세스를 안내합니다. 이 모듈에서는 계정 보안, 네트워킹, 컴퓨팅, 스토리지, 데이터베이스, 모니터링, 자동화, 컨테이너, 서버리스 아키텍처, 엣지 서비스, 백업 및 복구를 중점적으로 다룹니다. 과정이 끝나면 솔루션 구축을 연습하고 배운 내용을 자신 있게 적용할 수 있습니다. 이 과정은 클라우드 컴퓨팅의 기초 개념을 전반적으로 이해하고자 하는 비즈니스 리더를 위한 과정입니다. 클라우드 전략을 통해 비즈니스 목표를 충족하는 방법을 배웁니다. 이 과정에서는 비용 및 가치 영향을 평가하여 AWS에서 구축할 때의 비즈니스 가치를 이해하는 데 도움이 되는 Cloud Value Framework, 고객 사례 및 업계 추세를 통해 클라우드의 비즈니스 가치를 심층적으로 살펴봅니다. 이 기초 레벨 과정은 특정 기술 역할과 관계없이 AWS 클라우드를 전반적으로 이해하고자 하는 개인을 대상으로 합니다. AWS 클라우드에 대한 지식을 쌓을 수 있도록 AWS 클라우드 개념, AWS 서비스, 보안, 아키텍처, 요금 및 지원에 대해 배우게 됩니다. 이 과정은 또한 AWS Certified Cloud Practitioner 시험을 준비하는 데 도움이 됩니다. 이 과정은 솔루션스 아키텍트에게 AWS 클라우드로의 리프트 앤 시프트 마이그레이션을 성공적으로 계획하고 수행하는 데 필요한 기초 지식을 제공하기 위한 것입니다. 이 과정에서는 다양한 AWS 도구 및 서비스를 사용하여 마이그레이션을 검색, 계획, 수행 및 추적하는 방법론을 학습합니다 AWS Technical Essentials에서는 필수 AWS 서비스와 흔히 사용되는 솔루션을 소개합니다. 이 과정에서는 컴퓨팅, 데이터베이스, 스토리지, 네트워킹, 모니터링, 보안과 관련된 기초적인 AWS 개념에 대해 다룹니다. 먼저 과정 내의 실습 환경을 통해 AWS에서 작업을 수행해 보게 됩니다. 이 과정에서는 AWS 서비스를 더욱 자세히 파악하려면 알아 두어야 하는 개념을 다룹니다. 이러한 개념을 숙지하면 적절한 정보를 토대로 하여 비즈니스 요구 사항을 충족하는 솔루션을 결정할 수 있습니다. 이 과정을 진행하면 가용성, 내결함성, 확장성, 비용 효율성이 우수한 클라우드 솔루션을 구축, 비교, 적용하는 방법 관련 정보를 파악할 수 있습니다. AWS Well-Architected Framework는 클라우드 중심으로 고객의 아키텍처에 대해 정보에 입각한 결정을 내리고 설계 결정에 따른 영향을 이해하는 데 도움이 됩니다. Well-Architected Framework를 사용하면 아키텍처에 존재하는 위험과 이를 완화하는 방법을 이해할 수 있습니다. 이 과정에서는 AWS Well-Architected Framework와 여섯 가지 핵심 요소에 대해 심층적으로 살펴봅니다. 이 과정에서는 Well-Architected Review 프로세스와 AWS Well-Architected Tool을 사용하여 검토를 완료하는 방법도 다룹니다. 이 교육 과정은 AWS Well-Architected Framework와 6개의 핵심 요소에 대한 심층 분석을 제공하도록 구성되었습니다. 또한 이 과정에서는 Well-Architected 검토 프로세스와 AWS Well-Architected Tool을 사용하여 검토를 완료하는 방법을 다룹니다. 이 과정은 원래 1 Day 과정이지만, 실습 중심의 과정으로 실습 시간 확대와 고객 사례를 기반으로 하는 아키텍처 모범 사례를 추가하여 2 Days 일정으로 조정한 커스텀 과정입니다. 이 과정의 수강생들은 토론을 통해 직접 AWS 아키텍처의 모범사례를 논의하고 검토할 수 있는 역량을 검증할 수 있습니다. 이 과정에서는 엔터프라이즈급 Apache Spark 및 Apache Hadoop 관리형 서비스인 Amazon EMR을 통해 배치 데이터 분석 솔루션을 빌드하는 방법을 학습합니다. Amazon EMR를 Apache Hive, Hue, HBase 등의 오픈 소스 프로젝트와 통합하는 방법, AWS Glue 및 AWS Lake Formation 등의 AWS 서비스와 통합하는 방법을 알아봅니다. 이 과정에서는 Spark 및 Hadoop의 맥락에서 데이터 수집, 흡수, 카탈로그화, 저장, 처리 구성 요소를 다룹니다. 수강생은 EMR Notebooks를 사용하여 분석 및 머신러닝 워크로드를 지원하는 방법을 배웁니다. 또한 Amazon EMR 운영에 보안, 성능, 비용 관리 모범 실무를 적용하는 방법도 배우게 됩니다. 이 과정에서는 클라우드 기반 데이터 웨어하우스 서비스인 Amazon Redshift를 사용하여 데이터 분석 솔루션을 구축합니다. 이 과정에서는 분석 파이프라인의 데이터 수집, 흡수, 카탈로그화, 스토리지, 처리 구성 요소를 중점적으로 다룹니다. Amazon Redshift를 데이터 레이크와 결합하여 분석 워크로드와 머신러닝 워크로드를 모두 지원하는 방법을 배우게 됩니다. 또한 Amazon Redshift 운영에 보안, 성능, 비용 관리 모범 실무를 적용하는 방법도 배웁니다. 이 과정에서는 정형 데이터와 비정형 데이터 분석을 모두 지원하는 운영 데이터 레이크를 구축하는 방법에 대해 알아봅니다. 데이터 레이크 생성 관련 서비스의 구성 요소와 기능에 대해 배우게 됩니다. AWS Lake Formation을 이용해 데이터 레이크를 구축하고 AWS Glue를 이용해 데이터 카탈로그를 만들며 Amazon Athena를 이용해 데이터를 분석합니다. 강의와 실습을 통해 여러 일반적인 데이터 레이크 아키텍처를 살펴보면서 지식을 심화합니다. 이 과정의 대상은 데이터 특징이 복합적이고 데이터베이스에 밀리초 성능이 필요한 애플리케이션을 개발하려는 개발자, 아키텍트 및 데이터베이스 엔지니어입니다. 이 과정에서는 AWS 목적별 데이터베이스를 사용하여 다양한 액세스 패턴과 실시간 크기 조정이 가능한 대표적인 현대적 애플리케이션을 빌드합니다. 강좌를 마치면 Amazon DynamoDB, Amazon DocumentDB(Mongo 호환) 및 Amazon ElastiCache for Redis의 고급 기능을 설명할 수 있습니다. 이 과정에서는 Amazon Kinesis와 Amazon Managed Streaming for Apache Kafka(Amazon MSK)를 포함한 AWS 서비스를 사용하여 스트리밍 데이터 분석 솔루션을 구축하는 방법을 배웁니다. Amazon Kinesis는 확장성이 뛰어나고 내구성이 있는 실시간 데이터 스트리밍 서비스입니다. Amazon MSK는 안전하고 가용성이 뛰어난 완전관리형 Apache Kafka 서비스를 제공합니다. Kinesis와 Amazon MSK가 AWS Glue와 AWS Lambda 같은 AWS 서비스와 어떻게 통합되는지 알아봅니다. 이 과정에서는 데이터 분석 파이프라인의 스트리밍 데이터 수집, 스트림 스토리지, 스트림 처리 구성 요소를 다룹니다. 또한 보안, 성능, 비용 관리 모범 사례를 Kinesis 및 Amazon MSK 운영에 적용하는 방법도 알아봅니다. 이 과정에서는 클라우드 운영자와 클라우드 운영 기능을 수행하는 사용자를 대상으로 AWS에서 네트워크와 클라우드의 자동화 및 반복 가능한 배포를 관리하고 운영하는 방법을 학습합니다. 관련 서비스, 네트워크, 클라우드 설치, 구성, 자동화, 모니터링, 보안, 유지 관리, 문제 해결 등 클라우드 운영 기능에 대해 배우게 됩니다. 또한 이러한 기능과 관련된 특정 AWS 기능, 도구, 모범 사례도 다룹니다. AWS 기반 데이터 웨어하우징 과정에서는 AWS의 페타바이트 규모 데이터 웨어하우스인 Amazon Redshift를 사용하여 클라우드 기반 데이터 웨어하우징을 설계하기 위한 개념, 전략 및 모범 사례를 소개합니다. 본 과정에서는 Amazon DynamoDB, Amazon EMR, Amazon Kinesis, Amazon S3 같은 다른 AWS 서비스를 사용하여 데이터 웨어하우스를 위한 데이터를 수집, 저장, 준비하는 방법을 보여줍니다. 또한, 본 과정은 Amazon QuickSight를 사용하여 데이터에 대한 분석을 수행하는 방법도 보여줍니다. AWS는 데이터를 저장하고 액세스하고 보호하는 다양한 기능을 갖춘 스토리지 서비스 및 솔루션 옵션으로 구성된 광범위한 포트폴리오를 제공합니다. 이 과정에서는 이러한 다양한 서비스 제품을 언제, 어디에서, 어떻게 활용할 수 있는지 알아봅니다. 데이터 스토리지 문제를 해결하려는 경우 고려해야 할 서비스에 대해 알아봅니다. 사용 사례 및 비즈니스 요구 사항에 맞는 적절한 AWS 스토리지 서비스를 선택할 때 옵션을 가장 잘 평가하는 방법을 알아봅니다. 또한 클라우드에서 데이터를 저장하고 관리하고 보호하는 방법도 더 잘 이해하게 될 것입니다. AWS 플랫폼의 편리함과 강점을 보여 주는 일련의 핸즈온 실습을 통해 강력한 스토리지 솔루션을 몇 분 안에 빠르게 프로비저닝하는 방법을 배울 수 있습니다. 이 과정은 파인 튜닝 없이 대규모 언어 모델을 활용하는 데 관심이 있는 소프트웨어 개발자에게 생성형 AI를 소개하기 위해 고안되었습니다. 이 과정에서는 생성형 AI, 생성형 AI 프로젝트 계획, Amazon Bedrock 시작하기, 프롬프트 엔지니어링의 기초, Amazon Bedrock 및 LangChain을 사용하여 생성형 AI 애플리케이션을 구축하기 위한 아키텍처 패턴의 개요를 제공합니다. 이 과정은 숙련된 개발자에게 프로그래밍 방식으로 AWS 서비스와 상호 작용하여 웹 솔루션을 구축하는 방법을 가르칩니다. 리소스 선택에 관한 상위 수준 아키텍처 논의를 통해 진행하고, AWS 소프트웨어 개발 키트(AWS SDK)와 Command Line Interface(AWS CLI)를 사용하여 클라우드 애플리케이션을 구축하고 배포하는 방법을 심층 탐색합니다. 여러분은 샘플 애플리케이션을 구축하면서 개발 환경에 대한 권한을 설정하는 방법을 배우고, AWS 핵심 서비스를 사용하여 데이터를 처리하고, 사용자 인증을 구성하고, AWS 클라우드에 배포하고, 디버깅을 통해 애플리케이션 문제를 해결하는 비즈니스 로직을 추가합니다. 이 과정에서 설명한 설계 패턴 및 솔루션을 구현하는 데 도움이 되는 코드 예제가 포함되어 있습니다. 이러한 실습은 주요 과정 콘텐츠를 보강하며, Python, .NET, Java용 AWS SDK, AWS CLI, AWS Management Console을 사용하여 솔루션을 구현하는 데 도움이 됩니다. 이 과정에서는 개발자가 AWS Lambda 및 AWS 서버리스 플랫폼의 다른 서비스를 사용하여 서버리스 애플리케이션을 구축하는 모범 사례를 살펴보고 연습할 수 있습니다. 간단한 주제에서 좀 더 복잡한 주제로 진행되는 실습에서 AWS 프레임워크를 사용하여 직접 서버리스 애플리케이션을 배포하게 됩니다. 본 과정 내내 AWS 설명서를 사용하여 강의실을 넘어 진정한 학습 및 문제 해결 방법을 알아봅니다. DevOps Engineering on AWS 과정에서는 가장 일반적인 DevOps 패턴을 사용하여 AWS에서 애플리케이션을 개발, 배포 및 유지 관리하는 방법을 설명합니다. 이 과정에서는 DevOps 방법론의 핵심 원리를 설명하고 스타트업, 중소기업 및 대기업 개발 시나리오에 적용할 수 있는 여러 사용 사례를 살펴봅니다. 이 과정에서는 생성형 AI를 사용하기 위한 기본 개념, 방법 및 전략에 대해 배웁니다. 생성형 AI가 솔루션을 제공하고 비즈니스 요구 사항을 해결할 수 있는 사용 사례를 확실하게 이해할 수 있습니다. 또한 생성형 AI와 관련된 기술에 대한 실용적인 인사이트와 이러한 기술을 사용하여 실제 문제를 해결하는 방법을 배우게 됩니다. 교육 과정을 마치면 프로젝트 계획과 조직 내 생성형 AI 구현에 대해 논의하는 방법을 살펴보게 됩니다. 이 과정은 기존 워크로드를 계획하고 AWS 클라우드로 마이그레이션하는 방법을 이해하고자 하는 개인을 대상으로 합니다. 포트폴리오 검색, 애플리케이션 마이그레이션 계획 및 설계, 마이그레이션 실행, 마이그레이션 후 검증 및 애플리케이션 최적화 등 다양한 클라우드 마이그레이션 전략과 마이그레이션 프로세스의 단계별 적용 방법을 배웁니다. 조직에서 마이그레이션 작업을 완료하는 데 필요한 이해와 기초를 제공하고 학습을 강화하도록 설계된 실습이 포함되어 있습니다. 이 과정은 기계 학습 모델을 구축, 훈련 및 배포하기 위해 소프트웨어 개발에서 널리 사용되는 DevOps 방식을 기반으로 확장됩니다. 이 과정에서는 성공적인 기계 학습 배포를 위해 데이터, 모델 및 코드의 중요성을 강조합니다. 데이터 엔지니어, 데이터 사이언티스트, 소프트웨어 개발자, 운영 간의 이관과 관련된 과제들을 해결하는 데 도구, 자동화, 프로세스, 팀워크를 사용하는 방법을 보여줍니다. 또한 이 과정에서는 프로덕션에서 모델 예측이 합의된 핵심 성과 지표를 벗어나기 시작하는지 모니터링하고 조치를 취하기 위한 도구 및 프로세스의 사용에 대해서도 논의합니다. 이 과정을 통해 Amazon Web Services(AWS) 클라우드 환경 내의 네트워킹 개념과 서비스를 포괄적으로 이해할 수 있습니다. 초보 및 숙련된 네트워킹 엔지니어를 위해 설계된 이 과정에서는 필수 주제, 모범 사례, 실습을 다룹니다. 이 과정의 목적은 수강생이 AWS에서 네트워크 인프라를 설계, 구성, 최적화하는 데 필요한 지식과 기술을 갖추도록 하는 것입니다. 기계 학습(ML)으로 실제 문제를 해결하고 Amazon SageMaker의 사용에 대해서 학습합니다. 이 과정에서는 데이터 집합 분석 및 시각화부터 데이터 준비, 피쳐 엔지니어링에 이르기까지 기계 학습의 일반적인 데이터 과학 프로세스의 단계를  다룹니다. 또한 Amazon SageMaker를 사용하여 모델 구축, 교육, 튜닝 및 배포에 대한 실용적인 측면을 배우게 됩니다. 과정에서 다루게 되는 예제는 휴대폰 통신사의 고객 이탈 예측 문제 입니다. Terraform 은 전세계에서 가장 널리 쓰이는 IaC 도구 중 하나 입니다. 이 교육 과정에서는 AWS Solutions Architect 가 IaC 도구인 Terraform 을 활용해 AWS 아키텍처를 설계, 프로비저닝 하는 방법과 모범사례를 학습합니다. 이 과정에서는 Amazon EKS를 사용하여 Kubernetes로 컨테이너를 관리하고 오케스트레이션하는 방법을 알아봅니다. Amazon EKS를 사용하면 자체 Kubernetes 제어 영역을 설치, 운영, 유지 관리할 필요 없이 AWS에서 Kubernetes를 실행할 수 있습니다. Amazon Elastic Container Registry(Amazon ECR)를 사용하여 컨테이너 이미지를 관리하고 애플리케이션 배포를 자동화하는 방법을 배우게 됩니다. 지속적 통합(CI) 및 지속적 전달(CD) 도구를 사용하여 애플리케이션을 배포합니다. 지표, 기록, 추적, 수평적 및 수직적 크기 조정을 이용하여 환경을 모니터링하고 크기를 조정하는 방법을 배우게 됩니다. 또한 컨테이너식 애플리케이션의 스토리지를 관리하고, 클러스터를 지원하도록 AWS 네트워킹 서비스를 구성하고, Amazon EKS 환경을 보호하는 방법을 배우게 됩니다. AWS 보안 서비스를 사용하여 AWS 클라우드에서 보안을 유지하는 방법을 배웁니다. AWS에서 권장하는 보안 사례를 통해 클라우드에서 데이터 및 시스템 보안을 강화합니다. 이 과정에서는 컴퓨팅, 스토리지, 네트워킹, 데이터베이스 서비스 등 AWS 주요 서비스의 보안 기능을 살펴봅니다. 또한 자동화, 지속적 모니터링 및 로깅, 보안 인시던트에 대한 대응에 사용되는 AWS 서비스 및 도구의 사용 방법도 알아봅니다. Architecting on AWS의 수강 대상은 AWS 아키텍팅에 대한 이해를 높이고자 하는 솔루션스 아키텍트, 솔루션-설계 엔지니어 및 개발자입니다. 이 교육 과정에서는 복원력 있고, 안전하며, 가용성이 뛰어난 IT 솔루션을 AWS 클라우드에 구축하기 위한 서비스와 기능에 대해 배웁니다. 아키텍처 솔루션은 산업, 애플리케이션 유형, 비즈니스 규모에 따라 다릅니다. AWS 공인 강사들이 AWS Well-Architected Framework를 사용하는 모범 사례를 강조하고, 실제 시나리오를 기반으로 최적의 IT 솔루션을 설계하는 프로세스를 안내합니다. 이 모듈에서는 계정 보안, 네트워킹, 컴퓨팅, 스토리지, 데이터베이스, 모니터링, 자동화, 컨테이너, 서버리스 아키텍처, 엣지 서비스, 백업 및 복구를 중점적으로 다룹니다. 교육 과정이 끝나면 솔루션 구축을 연습하고 배운 내용을 적용할 수 있습니다. AWS Best Practices는 AWS 보안 및 제어 유형을 사용하기 위한 업계 모범 사례에 대한 개요를 제공합니다. 이 과정은 워크로드를 안전하게 유지하는 방법에 대한 중요한 지침을 제공하는 동시에 자신의 책임을 이해하는 데 도움이 됩니다. 양질의 설계 옵션으로 네트워크 인프라를 보호하는 방법을 배우게 됩니다. 또한 컴퓨팅 리소스를 강화하고 안전하게 관리하는 방법에 대해서도 알아봅니다. 마지막으로, AWS 모니터링 및 알림을 이해함으로써 의심스러운 이벤트를 감지하고 경고하여 손상 발생 가능성이 있을 때 신속하게 대응 프로세스를 시작할 수 있습니다. 이 과정에서는 AWS 액세스 제어, 데이터 암호화 방법, AWS 인프라에 대한 네트워크 액세스 보안을 유지하는 방법을 비롯하여 기본적인 AWS 클라우드 보안 개념에 대해 알아봅니다. AWS 공동 보안 모델을 기반으로 고객이 구현할 책임이 있는 AWS 클라우드에서의 보안은 무엇이고, 고객에게 제공되는 보안 지향 서비스에는 어떤 것이 있으며, 이러한 보안 서비스가 조직의 보안 요구 사항을 충족하는 데 도움이 되는 이유 및 방법을 알아봅니다. AWS Well-Architected Framework는 클라우드 중심으로 고객의 아키텍처에 대해 정보에 입각한 결정을 내리고 설계 결정에 따른 영향을 이해하는 데 도움이 됩니다. Well-Architected Framework를 사용하면 아키텍처에 존재하는 위험과 이를 완화하는 방법을 이해할 수 있습니다. 이 과정에서는 AWS Well-Architected Framework와 여섯 가지 핵심 요소에 대해 심층적으로 살펴봅니다. 이 과정에서는 Well-Architected Review 프로세스와 AWS Well-Architected Tool을 사용하여 검토를 완료하는 방법도 다룹니다. AWS Technical Essentials에서는 필수 Amazon Web Services 및 일반적인 솔루션을 소개합니다. 이 과정에서는 컴퓨팅, 데이터베이스, 스토리지, 네트워킹, 모니터링, 보안과 관련된 기초적인 AWS 개념에 대해 다룹니다. 먼저 과정 내의 실습 환경을 통해 AWS에서 작업을 수행해 봅니다. 이 과정에서는 AWS 서비스를 더욱 자세히 파악하려면 알아 두어야 하는 개념을 다룹니다. 이러한 개념을 숙지하면 적절한 정보를 토대로 하여 비즈니스 요구 사항을 충족하는 솔루션을 결정할 수 있습니다. 이 과정을 진행하면 가용성, 내결함성, 확장성, 비용 효율성이 우수한 클라우드 솔루션을 구축, 비교, 적용하는 방법에 관한 정보를 파악할 수 있습니다. 이 과정에서는 시스템 운영자와 시스템 운영 기능을 수행하는 사용자를 대상으로 AWS에서 네트워크와 시스템의 자동화 및 반복 가능한 배포를 관리하고 운영하는 방법을 학습합니다. 관련 서비스, 네트워크, 시스템의 설치, 구성, 자동화, 모니터링, 보안, 유지 관리, 문제 해결 등 시스템 운영 기능에 대해 배우게 됩니다. 그 밖에 해당 실무와 관련된 AWS 기능, 도구 및 모범 사례에 대해서도 구체적으로 알아보겠습니다. 이 과정은 파인 튜닝 없이 대규모 언어 모델을 활용하는 데 관심이 있는 소프트웨어 개발자에게 생성형 AI를 소개하기 위해 고안되었습니다. 이 과정에서는 생성형 AI, 생성형 AI 프로젝트 계획, Amazon Bedrock 시작하기, 프롬프트 엔지니어링의 기초, Amazon Bedrock 및 LangChain을 사용하여 생성형 AI 애플리케이션을 구축하기 위한 아키텍처 패턴의 개요를 제공합니다. 이 과정은 숙련된 개발자에게 프로그래밍 방식으로 AWS 서비스와 상호 작용하여 웹 솔루션을 구축하는 방법을 가르칩니다. 리소스 선택에 관한 상위 수준 아키텍처 논의를 통해 진행하고, AWS 소프트웨어 개발 키트(AWS SDK)와 Command Line Interface(AWS CLI)를 사용하여 클라우드 애플리케이션을 구축하고 배포하는 방법을 심층 탐색합니다. 여러분은 샘플 애플리케이션을 구축하면서 개발 환경에 대한 권한을 설정하는 방법을 배우고, AWS 핵심 서비스를 사용하여 데이터를 처리하고, 사용자 인증을 구성하고, AWS 클라우드에 배포하고, 디버깅을 통해 애플리케이션 문제를 해결하는 비즈니스 로직을 추가합니다. 이 과정에서 설명한 설계 패턴 및 솔루션을 구현하는 데 도움이 되는 코드 예제가 포함되어 있습니다. 이러한 실습은 주요 과정 콘텐츠를 보강하며, Python, .NET, Java용 AWS SDK, AWS CLI, AWS Management Console을 사용하여 솔루션을 구현하는 데 도움이 됩니다. 이 과정에서는 개발자가 AWS Lambda 및 AWS 서버리스 플랫폼의 다른 서비스를 사용하여 서버리스 애플리케이션을 구축하는 방법을 연습할 수 있습니다. 간단한 주제에서 좀 더 복잡한 주제로 진행되는 실습에서 AWS 프레임워크를 사용하여 직접 서버리스 애플리케이션을 배포하게 됩니다. 본 과정 내내 AWS 설명서를 사용하여 강의실을 넘어 진정한 학습 및 문제 해결 방법을 습득하게 됩니다. Digital Classroom – DevOps Engineering on AWS DevOps Engineering on AWS에서는 DevOps의 도구, 사례, 문화 철학을 조합하여 AWS에서 애플리케이션과 서비스를 빠르게 개발, 제공, 유지 관리하는 조직의 능력을 개선하는 방법을 설명합니다. 이 과정에서는 지속적 통합(CI), 지속적 전달(CD), 마이크로서비스, 코드형 인프라, 모니터링 및 로깅, 커뮤니케이션 및 협업을 다룹니다. Generative AI for Executives에서는 생성형 AI의 힘을 활용하여 실질적인 비즈니스 가치를 창출하는 방법을 알려드립니다. 먼저 이러한 새로운 AI 기술의 잠재력을 인식하고 즉시 구현할 수 있는 구체적인 사용 사례를 파악하는 것부터 시작합니다. 그 다음에는 생성형 AI를 안전하고 책임감 있게 사용하기 위한 모범 사례를 살펴보고 잠재적인 함정을 피할 수 있도록 합니다. 마지막으로, 생성형 AI를 조직에 성공적으로 통합하는 데 필요한 중요한 인력, 프로세스 및 기술 고려 사항을 배우게 됩니다. 이 과정을 마치면 생성형 AI를 시작하기 위한 다음 단계를 밟기 위한 실행 계획을 세울 수 있습니다. 이러한 기술을 처음 접하는 사람이든 전문성을 심화하고자 하는 사람이든 이 교육을 통해 생성형 AI의 비즈니스 가치를 최대한 활용할 수 있는 지식과 전략을 갖추게 될 것입니다. 이 교육 과정에서는 목적별 Amazon Web Services(AWS) 클라우드 데이터베이스를 사용하여 솔루션을 계획하고 설계하는 방법에 대해 배웁니다. 이 교육 과정에서는 이러한 데이터베이스 각각의 특징과 기능을 소개하고, 이를 사용할 때 고려해야 할 설계 고려 사항을 공유합니다. 이 교육 과정 수강을 통해 고유한 요구에 적합한 AWS 데이터베이스를 선택하는 데 필요한 분석 기술을 개발할 수 있습니다. 과정이 끝날 때 비즈니스 사용 사례 분석, 워크로드 분석, 애플리케이션 요구 사항 평가를 통해 조직의 요구를 지원하기에 가장 적합한 AWS 데이터베이스 솔루션을 파악하고 설계할 수 있습니다. Amazon EKS를 사용하면 자체 Kubernetes 컨트롤 플레인을 설치, 운영, 유지 관리할 필요 없이 AWS에서 Kubernetes를 실행할 수 있습니다. 이 과정에서는 Amazon EKS를 사용한 Kubernetes의 컨테이너 관리 및 오케스트레이션에 대해 학습합니다. 또한 Amazon EKS 클러스터를 구축하고, 환경을 구성하고, 클러스터를 배포한 후 클러스터에 애플리케이션을 추가해봅니다. Amazon Elastic Container Registry(Amazon ECR)를 사용하여 컨테이너 이미지를 관리하고 애플리케이션 배포를 자동화하는 방법을 배우게 됩니다. 지속적 통합(CI) 및 지속적 전달(CD) 도구를 사용하여 애플리케이션을 배포합니다. 지표, 기록, 추적, 수평/수직 확장을 이용하여 환경을 모니터링하고 크기를 조정하는 방법을 배우게 됩니다. 효율성, 비용, 복원력을 고려한 설계를 통해 대규모 컨테이너 환경을 설계하고 관리하는 방법을 배우게 됩니다. 또한 클러스터를 지원하도록 AWS 네트워킹 서비스를 구성하고 Amazon EKS 환경을 보호하는 방법을 배우게 됩니다. Digital Classroom - Security Engineering on AWS 보안은 클라우드 고객과 클라우드 도입을 고려하는 고객 모두의 관심사입니다. 사이버 공격과 데이터 유출의 증가는 대부분의 업계 종사자들이 여전히 가장 염두에 두고 있는 문제입니다. Security Engineering on AWS 과정은 이러한 걱정을 다룰 수 있도록 안전한 방식으로 Amazon Web Services(AWS)와 상호 작용하고 구축하는 방법을 더 잘 이해하실 수 있도록 도와드립니다. 이 과정에서는 자격 증명 및 역할 관리, 계정 관리 및 프로비저닝, 그리고 비정상API 활동 모니터링에 대해 알아봅니다. 또한 AWS에 저장된 데이터를 보호하는 방법에 대해서도 배우게 됩니다. 이 과정에서는 보안 인시던트를 파악하는 데 도움이 되는 로그를 생성, 수집 및 모니터링하는 방법을 살펴봅니다. 마지막으로, AWS 서비스를 통한 보안 인시던트의 탐지 및 조사를 검토할 것입니다. 이 과정에서는 프로젝트 기반 학습 환경에서 머신러닝(ML) 파이프라인을 사용하여 실제 비즈니스 문제를 해결하는 방법을 살펴봅니다. 수강생은 강사의 프레젠테이션과 데모를 통해 파이프라인의 각 단계에 대해 학습한 다음 해당 지식을 적용하여 사기 탐지 또는 항공편 지연이라는 두 가지 비즈니스 문제 중 하나를 해결하는 프로젝트를 완료합니다. 과정을 마치면 수강생은 선택한 비즈니스 문제를 해결하는 Amazon SageMaker를 사용하여 ML 모델을 성공적으로 구축, 교육, 평가, 조정 및 배포할 수 있게 됩니다. 머신 러닝 경험이나 지식이 거의 또는 전혀 없는 학습자도 이 과정을 통해 이점을 얻을 수 있습니다. 통계와 Python에 대한 기본 지식이 있으면 도움이 됩니다. ",
    "level": "미지정",
    "delivery_method": "3일",
    "duration": "미지정",
    "objectives": [],
    "audience": [],
    "prerequisites": [],
    "registration_link": "https://explore.skillbuilder.aws/learn/course/external/view/elearning/20864/digital-classroom-security-engineering-on-aws-korean",
    "modules": [],
    "labs": []
  }
]